'''Автор: Андреев Игорь Николаевич
Группа: ИУ7-14Б
'''
#Ввод данных и проверка
x = float(input('Введите координату x: '))
y = float(input('Введите координату y: '))
#Решение
f1 = ((-1 / 8 * (x + 9) ** 2 + 8) >= y >= (1 / 49 * (x + 1) ** 2) and -8 <= x <= -1)\
        or ((-1 / 8 * (x + 9) ** 2 + 8) >= y >= (7 * (x + 8) ** 2 + 1) and -9 <= x <= -8)
f2 = ((1 / 49 * (x - 1) ** 2) <= y <= (-1 / 8 * (x - 9) ** 2 + 8) and 1 <= x <= 8)\
         or ((7 * (x - 8) ** 2 + 1) <= y <= (-1 / 8 * (x - 9) ** 2 + 8) and 8 <= x <= 9)
f3 = ((-1 / 16 * x ** 2) >= y >= (-2 * (x + 1) ** 2 - 2) and -2 <= x <= -1)\
        or ((-1 / 16 * x ** 2) >= y >= (1 / 3 * (x + 5) ** 2 - 7) and -8 <= x <= -2)
f4 = ((-2 * (x - 1) ** 2 - 2) <= y <= (-1 / 16 * x ** 2) and 1 <= x <= 2)\
        or ((1 / 3 * (x - 5) ** 2 - 7) <= y <= (-1 / 16 * x ** 2) and 2 <= x <= 8)
f5 = ((-(4 * x ** 2) + 2) >= y >= (4 * x ** 2 - 6) and -1 <= x <= 1)
f6 = (y == 3 / 2 * x + 2 and 0 <= x <= 2) or (y == -3 / 2 * x + 2 and -2 <= x <= 0)
f7 = (x == -1 and -2 <= y <= 0) or (x == 1 and -2 <= y <= 0)
#Вывод данных
f = f1 or f2 or f3 or f4 or f5 or f6 or f7
print("Точка принадлежит заданной области!" * f + "Точка не принадлежит заданной области" * (not f))
